Общепит - отчеты и обработки/src/ExternalDataProcessors/тУстановитьБухСчетаВОтчетахОРозничныхПродажах/тУстановитьБухСчетаВОтчетахОРозничныхПродажах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>тУстановитьБухСчетаВОтчетахОРозничныхПродажах</name>
  <comment>версия 01.00</comment>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:ExternalDataProcessor>

Общепит - отчеты и обработки/src/ExternalDataProcessors/тУстановитьБухСчетаВОтчетахОРозничныхПродажах/Forms/Форма/Module.bsl
// Тимур - старт - 19.12.2019
&НаСервереБезКонтекста
Процедура УстановитьСчетаНаСервере(ДатаНачала, ДатаОкончания, СчетУчета, СчетДоходов)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОтчетОРозничныхПродажах.Ссылка КАК Ссылка,
	|	ОтчетОРозничныхПродажах.Представление КАК Представление
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|ГДЕ
	|	ОтчетОРозничныхПродажах.Дата >= &ДатаНачала
	|	И ОтчетОРозничныхПродажах.Дата <= &ДатаОкончания");
	
	Запрос.УстановитьПараметр("ДатаНачала",		НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",	КонецДня(ДатаОкончания));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнятьСчетУчета		= НЕ СчетУчета.Пустая();
	ЗаполнятьСчетДоходов	= НЕ СчетДоходов.Пустая();
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Для каждого СтрокаТЧ Из ДокументОбъект.Товары Цикл
			
			Если ЗаполнятьСчетУчета Тогда
				СтрокаТЧ.СчетУчета		= СчетУчета;
			КонецЕсли;
			Если ЗаполнятьСчетДоходов Тогда
				СтрокаТЧ.СчетДоходов	= СчетДоходов;
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого СтрокаТЧ Из ДокументОбъект.Возвраты Цикл
			
			Если ЗаполнятьСчетУчета Тогда
				СтрокаТЧ.СчетУчета		= СчетУчета;
			КонецЕсли;
			Если ЗаполнятьСчетДоходов Тогда
				СтрокаТЧ.СчетДоходов	= СчетДоходов;
			КонецЕсли;
			
		КонецЦикла;
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента[?(ДокументОбъект.Проведен, "Проведение", "Запись")]);
		Исключение
			Сообщение		= Новый СообщениеПользователю;
			Сообщение.Текст	= "Ошибка записи документа " + Выборка.Представление + ": " + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
	Сообщение		= Новый СообщениеПользователю;
	Сообщение.Текст	= "Обработка документов завершена.";
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСчета(Команда)
	УстановитьСчетаНаСервере(Объект.ДатаНачала, Объект.ДатаОкончания, Объект.СчетУчета, Объект.СчетДоходов);
КонецПроцедуры

// финиш - 19.12.2019
